MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PGTB/mcu.h
    INT_SRC_I2S2_ERRIRQOUT       = 389U,     /* I2S_2_ERRIRQOUT */
    /*  USART7 USART8  */
    INT_SRC_USART7_EI            = 390U,     /* USART_7_EI */
    INT_SRC_USART7_RI            = 391U,     /* USART_7_RI */
    INT_SRC_USART7_TI            = 392U,     /* USART_7_TI */
    INT_SRC_USART7_TCI           = 393U,     /* USART_7_TCI */
    INT_SRC_USART7_RTO           = 394U,     /* USART_7_RTO */
    INT_SRC_USART8_EI            = 395U,     /* USART_8_EI */
    INT_SRC_USART8_RI            = 396U,     /* USART_8_RI */
    INT_SRC_USART8_TI            = 397U,     /* USART_8_TI */
    INT_SRC_USART8_TCI           = 398U,     /* USART_8_TCI */
    /*  USBFS  */
    INT_SRC_USBFS_GLB            = 399U,     /* USBFS_GLB */
    INT_SRC_USBFS_WKUP           = 400U,     /* USBFS_WKUP */
    /*  HASH  */
    INT_SRC_HASH                 = 401U,     /* HASH_INT */
    /*  SDIOC  */
    INT_SRC_SDIOC1_SD            = 404U,     /* SDIOC_1_SD */
    INT_SRC_SDIOC2_SD            = 407U,     /* SDIOC_2_SD */
    /*  EVENT PORT  */
    INT_SRC_EVENT_PORT1          = 408U,     /* EVENT_PORT1 */
    INT_SRC_EVENT_PORT2          = 409U,     /* EVENT_PORT2 */
    INT_SRC_EVENT_PORT3          = 410U,     /* EVENT_PORT3 */
    INT_SRC_EVENT_PORT4          = 411U,     /* EVENT_PORT4 */
    /*  ETHER  */
    INT_SRC_ETH_GLB_INT          = 412U,     /* ETH_GLB_INT */
    INT_SRC_ETH_WKP_INT          = 413U,     /* ETH_WKP_INT */
    /*  I2S3 I2S4  */
    INT_SRC_I2S3_TXIRQOUT        = 416U,     /* I2S_3_TXIRQOUT */
    INT_SRC_I2S3_RXIRQOUT        = 417U,     /* I2S_3_RXIRQOUT */
    INT_SRC_I2S3_ERRIRQOUT       = 418U,     /* I2S_3_ERRIRQOUT */
    INT_SRC_I2S4_TXIRQOUT        = 419U,     /* I2S_4_TXIRQOUT */
    INT_SRC_I2S4_RXIRQOUT        = 420U,     /* I2S_4_RXIRQOUT */
    INT_SRC_I2S4_ERRIRQOUT       = 421U,     /* I2S_4_ERRIRQOUT */
    /*  USART9 USART10  */
    INT_SRC_USART9_EI            = 422U,     /* USART_9_EI */
    INT_SRC_USART9_RI            = 423U,     /* USART_9_RI */
    INT_SRC_USART9_TI            = 424U,     /* USART_9_TI */
    INT_SRC_USART9_TCI           = 425U,     /* USART_9_TCI */
    INT_SRC_USART10_BRKWKPI      = 426U,     /* USART_10_BRKWKPI */
    INT_SRC_USART10_EI           = 427U,     /* USART_10_EI */
    INT_SRC_USART10_RI           = 428U,     /* USART_10_RI */
    INT_SRC_USART10_TI           = 429U,     /* USART_10_TI */
    INT_SRC_USART10_TCI          = 430U,     /* USART_10_TCI */
    /*  I2C1 I2C2 I2C3  */
    INT_SRC_I2C1_RXI             = 432U,     /* I2C_1_RXI */
    INT_SRC_I2C1_TXI             = 433U,     /* I2C_1_TXI */
    INT_SRC_I2C1_TEI             = 434U,     /* I2C_1_TEI */
    INT_SRC_I2C1_EEI             = 435U,     /* I2C_1_EEI */
    INT_SRC_I2C2_RXI             = 436U,     /* I2C_2_RXI */
    INT_SRC_I2C2_TXI             = 437U,     /* I2C_2_TXI */
    INT_SRC_I2C2_TEI             = 438U,     /* I2C_2_TEI */
    INT_SRC_I2C2_EEI             = 439U,     /* I2C_2_EEI */
    INT_SRC_I2C3_RXI             = 440U,     /* I2C_3_RXI */
    INT_SRC_I2C3_TXI             = 441U,     /* I2C_3_TXI */
    INT_SRC_I2C3_TEI             = 442U,     /* I2C_3_TEI */
    INT_SRC_I2C3_EEI             = 443U,     /* I2C_3_EEI */
    /*  ACMP  */
    INT_SRC_CMP1                 = 444U,     /* CMP1 */
    INT_SRC_CMP2                 = 445U,     /* CMP2 */
    INT_SRC_CMP3                 = 446U,     /* CMP3 */
    INT_SRC_CMP4                 = 447U,     /* CMP4 */
    /*  I2C4 I2C5 I2C6  */
    INT_SRC_I2C4_RXI             = 448U,     /* I2C_4_RXI */
    INT_SRC_I2C4_TXI             = 449U,     /* I2C_4_TXI */
    INT_SRC_I2C4_TEI             = 450U,     /* I2C_4_TEI */
    INT_SRC_I2C4_EEI             = 451U,     /* I2C_4_EEI */
    INT_SRC_I2C5_RXI             = 452U,     /* I2C_5_RXI */
    INT_SRC_I2C5_TXI             = 453U,     /* I2C_5_TXI */
    INT_SRC_I2C5_TEI             = 454U,     /* I2C_5_TEI */
    INT_SRC_I2C5_EEI             = 455U,     /* I2C_5_EEI */
    INT_SRC_I2C6_RXI             = 456U,     /* I2C_6_RXI */
    INT_SRC_I2C6_TXI             = 457U,     /* I2C_6_TXI */
    INT_SRC_I2C6_TEI             = 458U,     /* I2C_6_TEI */
    INT_SRC_I2C6_EEI             = 459U,     /* I2C_6_EEI */
    /*  USART1  */
    INT_SRC_USART1_WUPI          = 460U,     /* USART_1_WUPI */
    /*  LVD  */
    INT_SRC_LVD1                = 461U,     /* LVD1 */
    INT_SRC_LVD2                = 462U,     /* LVD2 */
    /*  OTS  */
    INT_SRC_OTS                  = 463U,     /* OTS */
    /*  FCM  */
    INT_SRC_FCMFERRI             = 464U,     /* FCMFERRI */
    INT_SRC_FCMMENDI             = 465U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI             = 466U,     /* FCMCOVFI */
    /*  WDT  */
    INT_SRC_WDT_REFUDF           = 467U,     /* WDT_REFUDF */
    /*  CTC  */
    INT_SRC_CTC_ERR              = 468U,     /* CTC_ERR */
    /*  ADC  */
    INT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    INT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    INT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    INT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    INT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    INT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    INT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    INT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    INT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    INT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    INT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    INT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /*  TRNG  */
    INT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    /*  NFC  */
    INT_SRC_NFC_INT              = 496U,     /* NFC_INT */
    INT_SRC_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

/**
 * @brief ADC
 */
typedef struct {
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    uint8_t RESERVED1[4];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    __IO uint32_t AVCHSELR;
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED2[1];
    __IO uint16_t SHCR;
    uint8_t RESERVED3[4];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    __IO uint8_t  SSTR10;
    __IO uint8_t  SSTR11;
    __IO uint8_t  SSTR12;
    __IO uint8_t  SSTR13;
    __IO uint8_t  SSTR14;
    __IO uint8_t  SSTR15;
    __IO uint8_t  SSTRL;
    uint8_t RESERVED4[7];
    __IO uint16_t CHMUXR0;
    __IO uint16_t CHMUXR1;
    __IO uint16_t CHMUXR2;
    __IO uint16_t CHMUXR3;
    uint8_t RESERVED5[4];
    __I  uint8_t  ISR;
    __IO uint8_t  ICR;
    __IO uint8_t  ISCLRR;
    uint8_t RESERVED6[5];
    __IO uint16_t SYNCCR;
    uint8_t RESERVED7[2];
    __I  uint16_t DR0;
    __I  uint16_t DR1;
    __I  uint16_t DR2;
    __I  uint16_t DR3;
    __I  uint16_t DR4;
    __I  uint16_t DR5;
    __I  uint16_t DR6;
    __I  uint16_t DR7;
    __I  uint16_t DR8;
    __I  uint16_t DR9;
    __I  uint16_t DR10;
    __I  uint16_t DR11;
    __I  uint16_t DR12;
    __I  uint16_t DR13;
    __I  uint16_t DR14;
    __I  uint16_t DR15;
    __I  uint16_t DR16;
    __I  uint16_t DR17;
    __I  uint16_t DR18;
    __I  uint16_t DR19;
    uint8_t RESERVED8[40];
    __IO uint16_t AWDCR;
    __I  uint8_t  AWDSR;
    __IO uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint8_t  AWD0CHSR;
    uint8_t RESERVED9[3];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint8_t  AWD1CHSR;
    uint8_t RESERVED10[15];
    __IO uint8_t  PGACR1;
    __IO uint8_t  PGACR2;
    __IO uint8_t  PGACR3;
    uint8_t RESERVED11[1];
    __IO uint8_t  PGAVSSENR;
} CM_ADC_TypeDef;

/**
 * @brief AES
 */
typedef struct {
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
    __IO uint32_t KR4;
    __IO uint32_t KR5;
    __IO uint32_t KR6;
    __IO uint32_t KR7;
} CM_AES_TypeDef;

/**
 * @brief AOS
 */
typedef struct {
    __O  uint32_t INTSFTTRG;
    __IO uint32_t DCU_TRGSEL1;
    __IO uint32_t DCU_TRGSEL2;
    __IO uint32_t DCU_TRGSEL3;
    __IO uint32_t DCU_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL0;
    __IO uint32_t DMA1_TRGSEL1;
    __IO uint32_t DMA1_TRGSEL2;
    __IO uint32_t DMA1_TRGSEL3;
    __IO uint32_t DMA1_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL5;
    __IO uint32_t DMA1_TRGSEL6;
    __IO uint32_t DMA1_TRGSEL7;
    __IO uint32_t DMA2_TRGSEL0;
    __IO uint32_t DMA2_TRGSEL1;
    __IO uint32_t DMA2_TRGSEL2;
    __IO uint32_t DMA2_TRGSEL3;
    __IO uint32_t DMA2_TRGSEL4;
    __IO uint32_t DMA2_TRGSEL5;
    __IO uint32_t DMA2_TRGSEL6;
    __IO uint32_t DMA2_TRGSEL7;
    __IO uint32_t DMA_RC_TRGSEL;
    __IO uint32_t TMR6_TRGSEL0;
    __IO uint32_t TMR6_TRGSEL1;
    __IO uint32_t TMR6_TRGSEL2;
    __IO uint32_t TMR6_TRGSEL3;
    __IO uint32_t PEVNT_TRGSEL12;
    __IO uint32_t PEVNT_TRGSEL34;
    __IO uint32_t TMR0_TRGSEL;
    __IO uint32_t TMR2_TRGSEL;
    __IO uint32_t HASH_TRGSELB;
    __IO uint32_t HASH_TRGSELA;
    __IO uint32_t TMRA_TRGSEL0;
    __IO uint32_t TMRA_TRGSEL1;
    __IO uint32_t TMRA_TRGSEL2;
    __IO uint32_t TMRA_TRGSEL3;
    __IO uint32_t OTS_TRGSEL;
    __IO uint32_t ADC1_TRGSEL0;
    __IO uint32_t ADC1_TRGSEL1;
    __IO uint32_t ADC2_TRGSEL0;
    __IO uint32_t ADC2_TRGSEL1;
    __IO uint32_t ADC3_TRGSEL0;
    __IO uint32_t ADC3_TRGSEL1;
    __IO uint32_t COMTRG1;
    __IO uint32_t COMTRG2;
    uint8_t RESERVED0[76];
    __IO uint32_t PEVNTDIRR1;
    __I  uint32_t PEVNTIDR1;
    __IO uint32_t PEVNTODR1;
    __IO uint32_t PEVNTORR1;
    __IO uint32_t PEVNTOSR1;
    __IO uint32_t PEVNTRISR1;
    __IO uint32_t PEVNTFALR1;
    __IO uint32_t PEVNTDIRR2;
    __I  uint32_t PEVNTIDR2;
    __IO uint32_t PEVNTODR2;
    __IO uint32_t PEVNTORR2;
    __IO uint32_t PEVNTOSR2;
    __IO uint32_t PEVNTRISR2;
    __IO uint32_t PEVNTFALR2;
    __IO uint32_t PEVNTDIRR3;
    __I  uint32_t PEVNTIDR3;
    __IO uint32_t PEVNTODR3;
    __IO uint32_t PEVNTORR3;
    __IO uint32_t PEVNTOSR3;
    __IO uint32_t PEVNTRISR3;
    __IO uint32_t PEVNTFALR3;
    __IO uint32_t PEVNTDIRR4;
    __I  uint32_t PEVNTIDR4;
    __IO uint32_t PEVNTODR4;
    __IO uint32_t PEVNTORR4;
    __IO uint32_t PEVNTOSR4;
    __IO uint32_t PEVNTRISR4;
    __IO uint32_t PEVNTFALR4;
    __IO uint32_t PEVNTNFCR;
} CM_AOS_TypeDef;

/**
 * @brief CAN
 */
typedef struct {
    __I  uint32_t RBUF;
    uint8_t RESERVED0[76];
    __IO uint32_t TBUF;
    uint8_t RESERVED1[76];
    __IO uint8_t  CFG_STAT;
    __IO uint8_t  TCMD;
    __IO uint8_t  TCTRL;
    __IO uint8_t  RCTRL;
    __IO uint8_t  RTIE;
    __IO uint8_t  RTIF;
    __IO uint8_t  ERRINT;
    __IO uint8_t  LIMIT;
    __IO uint32_t SBT;
    __IO uint32_t FBT;
    __I  uint8_t  EALCAP;
    __IO uint8_t  TDC;
    __IO uint8_t  RECNT;
    __IO uint8_t  TECNT;
    __IO uint8_t  ACFCTRL;
    uint8_t RESERVED2[1];
    __IO uint16_t ACFEN;
    __IO uint32_t ACF;
    uint8_t RESERVED3[2];
    __IO uint8_t  TBSLOT;
    __IO uint8_t  TTCFG;
    __IO uint32_t REF_MSG;
    __IO uint16_t TRG_CFG;
    __IO uint16_t TT_TRIG;
    __IO uint16_t TT_WTRIG;
} CM_CAN_TypeDef;

/**
 * @brief CMP
 */
typedef struct {
    __IO uint8_t  MDR;
    __IO uint8_t  FIR;
    __IO uint8_t  OCR;
    __IO uint8_t  PMSR;
    __IO uint16_t TWSR;
    __IO uint16_t TWPR;
    __IO uint16_t VISR;
} CM_CMP_TypeDef;

/**
 * @brief CMU
 */
typedef struct {
    __IO uint8_t  XTAL32CR;
    uint8_t RESERVED0[3];
    __IO uint8_t  XTAL32CFGR;
    uint8_t RESERVED1[15];
    __IO uint8_t  XTAL32NFR;
    uint8_t RESERVED2[7];
    __IO uint8_t  LRCCR;
    uint8_t RESERVED3[7];
    __IO uint8_t  LRCTRM;
    uint8_t RESERVED4[7];
    __IO uint8_t  RTCLRCTRM;
    uint8_t RESERVED5[2123];
    __IO uint8_t  XTALCFGR;
    uint8_t RESERVED6[29591];
    __IO uint16_t PERICKSEL;
    __IO uint16_t I2SCKSEL;
    uint8_t RESERVED7[4];
    __IO uint8_t  CANCKCFGR;
    uint8_t RESERVED8[7];
    __IO uint32_t SCFGR;
    __IO uint8_t  USBCKCFGR;
    uint8_t RESERVED9[1];
    __IO uint8_t  CKSWR;
    uint8_t RESERVED10[3];
    __IO uint8_t  PLLHCR;
    uint8_t RESERVED11[3];
    __IO uint8_t  PLLACR;
    uint8_t RESERVED12[3];
    __IO uint8_t  XTALCR;
    uint8_t RESERVED13[3];
    __IO uint8_t  HRCCR;
    uint8_t RESERVED14[1];
    __IO uint8_t  MRCCR;
    uint8_t RESERVED15[3];
    __IO uint8_t  OSCSTBSR;
    __IO uint8_t  MCO1CFGR;
    __IO uint8_t  MCO2CFGR;
    __IO uint8_t  TPIUCKCFGR;
    __IO uint8_t  XTALSTDCR;
    __IO uint8_t  XTALSTDSR;
    uint8_t RESERVED16[31];
    __IO uint8_t  MRCTRM;
    __IO uint8_t  HRCTRM;
    uint8_t RESERVED17[63];
    __IO uint8_t  XTALSTBCR;
    uint8_t RESERVED18[93];
    __IO uint32_t PLLHCFGR;
    __IO uint32_t PLLACFGR;
} CM_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t RESLT;
    uint8_t RESERVED0[120];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
} CM_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __I  uint32_t STR;
} CM_CTC_TypeDef;

/**
 * @brief DAC
 */
typedef struct {
    __IO uint16_t DADR1;
    __IO uint16_t DADR2;
    __IO uint16_t DACR;
    __IO uint16_t DAADPCR;
    uint8_t RESERVED0[20];
    __IO uint16_t DAOCR;
} CM_DAC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct {
    __IO uint32_t AUTHID0;
    __IO uint32_t AUTHID1;
    __IO uint32_t AUTHID2;
    uint8_t RESERVED0[4];
    __IO uint32_t MCUSTAT;
    uint8_t RESERVED1[4];
    __IO uint32_t FERSCTL;
    __IO uint32_t MCUDBGCSTAT;
    __IO uint32_t MCUSTPCTL;
    __IO uint32_t MCUTRACECTL;
    __IO uint32_t MCUSTPCTL2;
} CM_DBGC_TypeDef;

/**
 * @brief DCU
 */
typedef struct {
    __IO uint32_t CTL;
    __I  uint32_t FLAG;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    __IO uint32_t FLAGCLR;
    __IO uint32_t INTEVTSEL;
} CM_DCU_TypeDef;

/**
 * @brief DMA
 */
typedef struct {
    __IO uint32_t EN;
    __I  uint32_t INTSTAT0;
    __I  uint32_t INTSTAT1;
    __IO uint32_t INTMASK0;
    __IO uint32_t INTMASK1;
    __IO uint32_t INTCLR0;
    __IO uint32_t INTCLR1;
    __IO uint32_t CHEN;
    __I  uint32_t REQSTAT;
    __I  uint32_t CHSTAT;
    uint8_t RESERVED0[4];
    __IO uint32_t RCFGCTL;
    uint8_t RESERVED1[4];
    __IO uint32_t CHENCLR;
    uint8_t RESERVED2[8];
    __IO uint32_t SAR0;
    __IO uint32_t DAR0;
    __IO uint32_t DTCTL0;
    union {
        __IO uint32_t RPT0;
        __IO uint32_t RPTB0;
    };
    union {
        __IO uint32_t SNSEQCTL0;
        __IO uint32_t SNSEQCTLB0;
    };
    union {
        __IO uint32_t DNSEQCTL0;
        __IO uint32_t DNSEQCTLB0;
    };
    __IO uint32_t LLP0;
    __IO uint32_t CHCTL0;
    __I  uint32_t MONSAR0;
    __I  uint32_t MONDAR0;
    __I  uint32_t MONDTCTL0;
    __I  uint32_t MONRPT0;
    __I  uint32_t MONSNSEQCTL0;
    __I  uint32_t MONDNSEQCTL0;
    uint8_t RESERVED3[8];
    __IO uint32_t SAR1;
    __IO uint32_t DAR1;
    __IO uint32_t DTCTL1;
    union {
        __IO uint32_t RPT1;
        __IO uint32_t RPTB1;
    };
    union {
        __IO uint32_t SNSEQCTL1;
        __IO uint32_t SNSEQCTLB1;
    };
    union {
        __IO uint32_t DNSEQCTL1;
        __IO uint32_t DNSEQCTLB1;
    };
    __IO uint32_t LLP1;
    __IO uint32_t CHCTL1;
    __I  uint32_t MONSAR1;
    __I  uint32_t MONDAR1;
    __I  uint32_t MONDTCTL1;
    __I  uint32_t MONRPT1;
    __I  uint32_t MONSNSEQCTL1;
    __I  uint32_t MONDNSEQCTL1;
    uint8_t RESERVED4[8];
    __IO uint32_t SAR2;
    __IO uint32_t DAR2;
    __IO uint32_t DTCTL2;
    union {
        __IO uint32_t RPT2;
        __IO uint32_t RPTB2;
    };
    union {
        __IO uint32_t SNSEQCTL2;
        __IO uint32_t SNSEQCTLB2;
    };
    union {
        __IO uint32_t DNSEQCTL2;
        __IO uint32_t DNSEQCTLB2;
    };
    __IO uint32_t LLP2;
    __IO uint32_t CHCTL2;
    __I  uint32_t MONSAR2;
    __I  uint32_t MONDAR2;
    __I  uint32_t MONDTCTL2;
    __I  uint32_t MONRPT2;
    __I  uint32_t MONSNSEQCTL2;
    __I  uint32_t MONDNSEQCTL2;
    uint8_t RESERVED5[8];
    __IO uint32_t SAR3;
    __IO uint32_t DAR3;
    __IO uint32_t DTCTL3;
    union {
        __IO uint32_t RPT3;
        __IO uint32_t RPTB3;
    };
    union {
        __IO uint32_t SNSEQCTL3;
        __IO uint32_t SNSEQCTLB3;
    };
    union {
        __IO uint32_t DNSEQCTL3;
        __IO uint32_t DNSEQCTLB3;
    };
    __IO uint32_t LLP3;
    __IO uint32_t CHCTL3;
    __I  uint32_t MONSAR3;
    __I  uint32_t MONDAR3;
    __I  uint32_t MONDTCTL3;
    __I  uint32_t MONRPT3;
    __I  uint32_t MONSNSEQCTL3;
    __I  uint32_t MONDNSEQCTL3;
    uint8_t RESERVED6[8];
    __IO uint32_t SAR4;
    __IO uint32_t DAR4;
    __IO uint32_t DTCTL4;
    union {
        __IO uint32_t RPT4;
        __IO uint32_t RPTB4;
    };
    union {
        __IO uint32_t SNSEQCTL4;
        __IO uint32_t SNSEQCTLB4;
    };
    union {
        __IO uint32_t DNSEQCTL4;
        __IO uint32_t DNSEQCTLB4;
    };
    __IO uint32_t LLP4;
    __IO uint32_t CHCTL4;
    __I  uint32_t MONSAR4;
    __I  uint32_t MONDAR4;
    __I  uint32_t MONDTCTL4;
    __I  uint32_t MONRPT4;
    __I  uint32_t MONSNSEQCTL4;
    __I  uint32_t MONDNSEQCTL4;
    uint8_t RESERVED7[8];
    __IO uint32_t SAR5;
    __IO uint32_t DAR5;
    __IO uint32_t DTCTL5;
    union {
        __IO uint32_t RPT5;
        __IO uint32_t RPTB5;
    };
    union {
        __IO uint32_t SNSEQCTL5;
        __IO uint32_t SNSEQCTLB5;
    };
    union {
        __IO uint32_t DNSEQCTL5;
        __IO uint32_t DNSEQCTLB5;
    };
    __IO uint32_t LLP5;
    __IO uint32_t CHCTL5;
    __I  uint32_t MONSAR5;
    __I  uint32_t MONDAR5;
    __I  uint32_t MONDTCTL5;
    __I  uint32_t MONRPT5;
    __I  uint32_t MONSNSEQCTL5;
    __I  uint32_t MONDNSEQCTL5;
    uint8_t RESERVED8[8];
    __IO uint32_t SAR6;
    __IO uint32_t DAR6;
    __IO uint32_t DTCTL6;
    union {
        __IO uint32_t RPT6;
        __IO uint32_t RPTB6;
    };
    union {
        __IO uint32_t SNSEQCTL6;
        __IO uint32_t SNSEQCTLB6;
    };
    union {
        __IO uint32_t DNSEQCTL6;
        __IO uint32_t DNSEQCTLB6;
    };
    __IO uint32_t LLP6;
    __IO uint32_t CHCTL6;
    __I  uint32_t MONSAR6;
    __I  uint32_t MONDAR6;
    __I  uint32_t MONDTCTL6;
    __I  uint32_t MONRPT6;
    __I  uint32_t MONSNSEQCTL6;
    __I  uint32_t MONDNSEQCTL6;
    uint8_t RESERVED9[8];
    __IO uint32_t SAR7;
    __IO uint32_t DAR7;
    __IO uint32_t DTCTL7;
    union {
        __IO uint32_t RPT7;
        __IO uint32_t RPTB7;
    };
    union {
        __IO uint32_t SNSEQCTL7;
        __IO uint32_t SNSEQCTLB7;
    };
    union {
        __IO uint32_t DNSEQCTL7;
        __IO uint32_t DNSEQCTLB7;
    };
    __IO uint32_t LLP7;
    __IO uint32_t CHCTL7;
    __I  uint32_t MONSAR7;
    __I  uint32_t MONDAR7;
    __I  uint32_t MONDTCTL7;
    __I  uint32_t MONRPT7;
    __I  uint32_t MONSNSEQCTL7;
    __I  uint32_t MONDNSEQCTL7;
} CM_DMA_TypeDef;

/**
 * @brief DMC
 */
typedef struct {
    __I  uint32_t STSR;
    __O  uint32_t STCR;
    __O  uint32_t CMDR;
    __IO uint32_t CPCR;
    __IO uint32_t RFTR;
    __IO uint32_t TMCR_T_CASL;
    __IO uint32_t TMCR_T_DQSS;
    __IO uint32_t TMCR_T_MRD;
    __IO uint32_t TMCR_T_RAS;
    __IO uint32_t TMCR_T_RC;
    __IO uint32_t TMCR_T_RCD;
    __IO uint32_t TMCR_T_RFC;
    __IO uint32_t TMCR_T_RP;
    __IO uint32_t TMCR_T_RRD;
    __IO uint32_t TMCR_T_WR;
    __IO uint32_t TMCR_T_WTR;
    __IO uint32_t TMCR_T_XP;
    __IO uint32_t TMCR_T_XSR;
    __IO uint32_t TMCR_T_ESR;
    uint8_t RESERVED0[436];
    __IO uint32_t CSCR0;
    __IO uint32_t CSCR1;
    __IO uint32_t CSCR2;
    __IO uint32_t CSCR3;
    uint8_t RESERVED1[240];
    __IO uint32_t BACR;
} CM_DMC_TypeDef;

/**
 * @brief DVP
 */
typedef struct {
    __IO uint32_t CTR;
    __I  uint32_t DTR;
    __IO uint32_t STR;
    __IO uint32_t IER;
    __I  uint32_t DMR;
    uint8_t RESERVED0[12];
    __IO uint32_t SSYNDR;
    __IO uint32_t SSYNMR;
    __IO uint32_t CPSFTR;
    __IO uint32_t CPSZER;
} CM_DVP_TypeDef;

/**
 * @brief EFM
 */
typedef struct {
    __IO uint32_t FAPRT;
    __IO uint32_t KEY1;
    __IO uint32_t KEY2;
    uint8_t RESERVED0[8];
    __IO uint32_t FSTP;
    __IO uint32_t FRMC;
    __IO uint32_t FWMC;
    __I  uint32_t FSR;
    __IO uint32_t FSCLR;
    __IO uint32_t FITE;
    __I  uint32_t FSWP;
    uint8_t RESERVED1[16];
    __I  uint32_t CHIPID;
    uint8_t RESERVED2[12];
    __I  uint32_t UQID0;
    __I  uint32_t UQID1;
    __I  uint32_t UQID2;
    uint8_t RESERVED3[164];
    __IO uint32_t MMF_REMPRT;
    __IO uint32_t MMF_REMCR0;
    __IO uint32_t MMF_REMCR1;
    uint8_t RESERVED4[116];
    __IO uint32_t WLOCK;
    uint8_t RESERVED5[12];
    __IO uint32_t F0NWPRT0;
    __IO uint32_t F0NWPRT1;
    __IO uint32_t F0NWPRT2;
    __IO uint32_t F0NWPRT3;
    __IO uint32_t F1NWPRT0;
    __IO uint32_t F1NWPRT1;
    __IO uint32_t F1NWPRT2;
    __IO uint32_t F1NWPRT3;
} CM_EFM_TypeDef;

/**
 * @brief EMB
 */
typedef struct {
    __IO uint32_t CTL1;
    __IO uint32_t CTL2;
    __IO uint32_t SOE;
    __I  uint32_t STAT;
    __O  uint32_t STATCLR;
    __IO uint32_t INTEN;
    __IO uint32_t RLSSEL;
} CM_EMB_TypeDef;

