MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PGTB/mcu.h
typedef struct {
    __IO uint32_t OTPWERRCLR0;
    __IO uint32_t PRTWERRCLR0;
    __IO uint32_t PGSZERRCLR0;
    __IO uint32_t MISMTCHCLR0;
    __IO uint32_t OPTENDCLR0;
    __IO uint32_t COLERRCLR0;
    uint32_t RESERVED0[11];
    __IO uint32_t PRTWERRCLR1;
    __IO uint32_t PGSZERRCLR1;
    __IO uint32_t MISMTCHCLR1;
    __IO uint32_t OPTENDCLR1;
    __IO uint32_t COLERRCLR1;
    uint32_t RESERVED1[10];
} stc_efm_fsclr_bit_t;

typedef struct {
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct {
    __I  uint32_t FSWP;
    uint32_t RESERVED0[31];
} stc_efm_fswp_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t EN;
} stc_efm_mmf_remcr_bit_t;

typedef struct {
    __IO uint32_t F0NWPRT0;
    __IO uint32_t F0NWPRT1;
    __IO uint32_t F0NWPRT2;
    __IO uint32_t F0NWPRT3;
    __IO uint32_t F0NWPRT4;
    __IO uint32_t F0NWPRT5;
    __IO uint32_t F0NWPRT6;
    __IO uint32_t F0NWPRT7;
    __IO uint32_t F0NWPRT8;
    __IO uint32_t F0NWPRT9;
    __IO uint32_t F0NWPRT10;
    __IO uint32_t F0NWPRT11;
    __IO uint32_t F0NWPRT12;
    __IO uint32_t F0NWPRT13;
    __IO uint32_t F0NWPRT14;
    __IO uint32_t F0NWPRT15;
    __IO uint32_t F0NWPRT16;
    __IO uint32_t F0NWPRT17;
    __IO uint32_t F0NWPRT18;
    __IO uint32_t F0NWPRT19;
    __IO uint32_t F0NWPRT20;
    __IO uint32_t F0NWPRT21;
    __IO uint32_t F0NWPRT22;
    __IO uint32_t F0NWPRT23;
    __IO uint32_t F0NWPRT24;
    __IO uint32_t F0NWPRT25;
    __IO uint32_t F0NWPRT26;
    __IO uint32_t F0NWPRT27;
    __IO uint32_t F0NWPRT28;
    __IO uint32_t F0NWPRT29;
    __IO uint32_t F0NWPRT30;
    __IO uint32_t F0NWPRT31;
} stc_efm_f0nwprt0_bit_t;

typedef struct {
    __IO uint32_t F0NWPRT32;
    __IO uint32_t F0NWPRT33;
    __IO uint32_t F0NWPRT34;
    __IO uint32_t F0NWPRT35;
    __IO uint32_t F0NWPRT36;
    __IO uint32_t F0NWPRT37;
    __IO uint32_t F0NWPRT38;
    __IO uint32_t F0NWPRT39;
    __IO uint32_t F0NWPRT40;
    __IO uint32_t F0NWPRT41;
    __IO uint32_t F0NWPRT42;
    __IO uint32_t F0NWPRT43;
    __IO uint32_t F0NWPRT44;
    __IO uint32_t F0NWPRT45;
    __IO uint32_t F0NWPRT46;
    __IO uint32_t F0NWPRT47;
    __IO uint32_t F0NWPRT48;
    __IO uint32_t F0NWPRT49;
    __IO uint32_t F0NWPRT50;
    __IO uint32_t F0NWPRT51;
    __IO uint32_t F0NWPRT52;
    __IO uint32_t F0NWPRT53;
    __IO uint32_t F0NWPRT54;
    __IO uint32_t F0NWPRT55;
    __IO uint32_t F0NWPRT56;
    __IO uint32_t F0NWPRT57;
    __IO uint32_t F0NWPRT58;
    __IO uint32_t F0NWPRT59;
    __IO uint32_t F0NWPRT60;
    __IO uint32_t F0NWPRT61;
    __IO uint32_t F0NWPRT62;
    __IO uint32_t F0NWPRT63;
} stc_efm_f0nwprt1_bit_t;

typedef struct {
    __IO uint32_t F0NWPRT64;
    __IO uint32_t F0NWPRT65;
    __IO uint32_t F0NWPRT66;
    __IO uint32_t F0NWPRT67;
    __IO uint32_t F0NWPRT68;
    __IO uint32_t F0NWPRT69;
    __IO uint32_t F0NWPRT70;
    __IO uint32_t F0NWPRT71;
    __IO uint32_t F0NWPRT72;
    __IO uint32_t F0NWPRT73;
    __IO uint32_t F0NWPRT74;
    __IO uint32_t F0NWPRT75;
    __IO uint32_t F0NWPRT76;
    __IO uint32_t F0NWPRT77;
    __IO uint32_t F0NWPRT78;
    __IO uint32_t F0NWPRT79;
    __IO uint32_t F0NWPRT80;
    __IO uint32_t F0NWPRT81;
    __IO uint32_t F0NWPRT82;
    __IO uint32_t F0NWPRT83;
    __IO uint32_t F0NWPRT84;
    __IO uint32_t F0NWPRT85;
    __IO uint32_t F0NWPRT86;
    __IO uint32_t F0NWPRT87;
    __IO uint32_t F0NWPRT88;
    __IO uint32_t F0NWPRT89;
    __IO uint32_t F0NWPRT90;
    __IO uint32_t F0NWPRT91;
    __IO uint32_t F0NWPRT92;
    __IO uint32_t F0NWPRT93;
    __IO uint32_t F0NWPRT94;
    __IO uint32_t F0NWPRT95;
} stc_efm_f0nwprt2_bit_t;

typedef struct {
    __IO uint32_t F0NWPRT96;
    __IO uint32_t F0NWPRT97;
    __IO uint32_t F0NWPRT98;
    __IO uint32_t F0NWPRT99;
    __IO uint32_t F0NWPRT100;
    __IO uint32_t F0NWPRT101;
    __IO uint32_t F0NWPRT102;
    __IO uint32_t F0NWPRT103;
    __IO uint32_t F0NWPRT104;
    __IO uint32_t F0NWPRT105;
    __IO uint32_t F0NWPRT106;
    __IO uint32_t F0NWPRT107;
    __IO uint32_t F0NWPRT108;
    __IO uint32_t F0NWPRT109;
    __IO uint32_t F0NWPRT110;
    __IO uint32_t F0NWPRT111;
    __IO uint32_t F0NWPRT112;
    __IO uint32_t F0NWPRT113;
    __IO uint32_t F0NWPRT114;
    __IO uint32_t F0NWPRT115;
    __IO uint32_t F0NWPRT116;
    __IO uint32_t F0NWPRT117;
    __IO uint32_t F0NWPRT118;
    __IO uint32_t F0NWPRT119;
    __IO uint32_t F0NWPRT120;
    __IO uint32_t F0NWPRT121;
    __IO uint32_t F0NWPRT122;
    __IO uint32_t F0NWPRT123;
    __IO uint32_t F0NWPRT124;
    __IO uint32_t F0NWPRT125;
    __IO uint32_t F0NWPRT126;
    __IO uint32_t F0NWPRT127;
} stc_efm_f0nwprt3_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT0;
    __IO uint32_t F1NWPRT1;
    __IO uint32_t F1NWPRT2;
    __IO uint32_t F1NWPRT3;
    __IO uint32_t F1NWPRT4;
    __IO uint32_t F1NWPRT5;
    __IO uint32_t F1NWPRT6;
    __IO uint32_t F1NWPRT7;
    __IO uint32_t F1NWPRT8;
    __IO uint32_t F1NWPRT9;
    __IO uint32_t F1NWPRT10;
    __IO uint32_t F1NWPRT11;
    __IO uint32_t F1NWPRT12;
    __IO uint32_t F1NWPRT13;
    __IO uint32_t F1NWPRT14;
    __IO uint32_t F1NWPRT15;
    __IO uint32_t F1NWPRT16;
    __IO uint32_t F1NWPRT17;
    __IO uint32_t F1NWPRT18;
    __IO uint32_t F1NWPRT19;
    __IO uint32_t F1NWPRT20;
    __IO uint32_t F1NWPRT21;
    __IO uint32_t F1NWPRT22;
    __IO uint32_t F1NWPRT23;
    __IO uint32_t F1NWPRT24;
    __IO uint32_t F1NWPRT25;
    __IO uint32_t F1NWPRT26;
    __IO uint32_t F1NWPRT27;
    __IO uint32_t F1NWPRT28;
    __IO uint32_t F1NWPRT29;
    __IO uint32_t F1NWPRT30;
    __IO uint32_t F1NWPRT31;
} stc_efm_f1nwprt0_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT32;
    __IO uint32_t F1NWPRT33;
    __IO uint32_t F1NWPRT34;
    __IO uint32_t F1NWPRT35;
    __IO uint32_t F1NWPRT36;
    __IO uint32_t F1NWPRT37;
    __IO uint32_t F1NWPRT38;
    __IO uint32_t F1NWPRT39;
    __IO uint32_t F1NWPRT40;
    __IO uint32_t F1NWPRT41;
    __IO uint32_t F1NWPRT42;
    __IO uint32_t F1NWPRT43;
    __IO uint32_t F1NWPRT44;
    __IO uint32_t F1NWPRT45;
    __IO uint32_t F1NWPRT46;
    __IO uint32_t F1NWPRT47;
    __IO uint32_t F1NWPRT48;
    __IO uint32_t F1NWPRT49;
    __IO uint32_t F1NWPRT50;
    __IO uint32_t F1NWPRT51;
    __IO uint32_t F1NWPRT52;
    __IO uint32_t F1NWPRT53;
    __IO uint32_t F1NWPRT54;
    __IO uint32_t F1NWPRT55;
    __IO uint32_t F1NWPRT56;
    __IO uint32_t F1NWPRT57;
    __IO uint32_t F1NWPRT58;
    __IO uint32_t F1NWPRT59;
    __IO uint32_t F1NWPRT60;
    __IO uint32_t F1NWPRT61;
    __IO uint32_t F1NWPRT62;
    __IO uint32_t F1NWPRT63;
} stc_efm_f1nwprt1_bit_t;

