MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PGTB/mcu.h
typedef struct {
    __IO uint32_t FCA_BPA;
    __IO uint32_t TFE;
    __IO uint32_t RFE;
    __IO uint32_t UNP;
    uint32_t RESERVED0[3];
    __IO uint32_t DZPQ;
    uint32_t RESERVED1[24];
} stc_eth_mac_floctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __IO uint32_t VTAL;
    __IO uint32_t VTIM;
    uint32_t RESERVED1[1];
    __IO uint32_t VTHM;
    uint32_t RESERVED2[12];
} stc_eth_mac_vtafltr_bit_t;

typedef struct {
    __I  uint32_t MREA;
    uint32_t RESERVED0[3];
    __I  uint32_t RFWA;
    uint32_t RESERVED1[11];
    __I  uint32_t MTEA;
    uint32_t RESERVED2[2];
    __I  uint32_t MTP;
    uint32_t RESERVED3[2];
    __I  uint32_t TFWA;
    uint32_t RESERVED4[1];
    __I  uint32_t TFNE;
    __I  uint32_t TFF;
    uint32_t RESERVED5[6];
} stc_eth_mac_macstsr_bit_t;

typedef struct {
    __IO uint32_t PWDN;
    __IO uint32_t MPEN;
    __IO uint32_t WKEN;
    uint32_t RESERVED0[2];
    __I  uint32_t MPFR;
    __I  uint32_t WKFR;
    uint32_t RESERVED1[2];
    __IO uint32_t GLUB;
    __IO uint32_t RTWKTR;
    uint32_t RESERVED2[20];
    __IO uint32_t RTWKFR;
} stc_eth_mac_pmtctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t PMTIS;
    __I  uint32_t MMCIS;
    __I  uint32_t MMCRXIS;
    __I  uint32_t MMCTXIS;
    uint32_t RESERVED1[2];
    __I  uint32_t TSPIS;
    uint32_t RESERVED2[22];
} stc_eth_mac_intstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIM;
    uint32_t RESERVED1[5];
    __IO uint32_t TSPIM;
    uint32_t RESERVED2[22];
} stc_eth_mac_intmskr_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __I  uint32_t AE0;
} stc_eth_mac_macadhr0_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA1;
    __IO uint32_t AE1;
} stc_eth_mac_macadhr1_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA2;
    __IO uint32_t AE2;
} stc_eth_mac_macadhr2_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA3;
    __IO uint32_t AE3;
} stc_eth_mac_macadhr3_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA4;
    __IO uint32_t AE4;
} stc_eth_mac_macadhr4_bit_t;

typedef struct {
    __IO uint32_t CRST;
    __IO uint32_t COS;
    __IO uint32_t ROR;
    __IO uint32_t MCF;
    __IO uint32_t MCPSET;
    __IO uint32_t MCPSEL;
    uint32_t RESERVED0[26];
} stc_eth_mmc_mmcctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t RXBGIS;
    __I  uint32_t RXMGIS;
    __I  uint32_t RXCEIS;
    __I  uint32_t RXAEIS;
    __I  uint32_t RXREIS;
    uint32_t RESERVED1[9];
    __I  uint32_t RXUGIS;
    __I  uint32_t RXLEIS;
    __I  uint32_t RXOEIS;
    uint32_t RESERVED2[12];
} stc_eth_mmc_revstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __I  uint32_t TXBGIS;
    __I  uint32_t TXMGIS;
    uint32_t RESERVED1[12];
    __I  uint32_t TXDEEIS;
    __I  uint32_t TXLCEIS;
    __I  uint32_t TXECEIS;
    __I  uint32_t TXCAEIS;
    uint32_t RESERVED2[1];
    __I  uint32_t TXUGIS;
    __I  uint32_t TXEDEIS;
    uint32_t RESERVED3[9];
} stc_eth_mmc_trsstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIM;
    __IO uint32_t RXMGIM;
    __IO uint32_t RXCEIM;
    __IO uint32_t RXAEIM;
    __IO uint32_t RXREIM;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIM;
    __IO uint32_t RXLEIM;
    __IO uint32_t RXOEIM;
    uint32_t RESERVED2[12];
} stc_eth_mmc_ritctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIM;
    __IO uint32_t TXMGIM;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIM;
    __IO uint32_t TXLCEIM;
    __IO uint32_t TXECEIM;
    __IO uint32_t TXCAEIM;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIM;
    __IO uint32_t TXEDEIM;
    uint32_t RESERVED3[9];
} stc_eth_mmc_titctlr_bit_t;

typedef struct {
    __IO uint32_t L3PEN;
    uint32_t RESERVED0[1];
    __IO uint32_t L3SAM;
    __IO uint32_t L3SAIM;
    __IO uint32_t L3DAM;
    __IO uint32_t L3DAIM;
    uint32_t RESERVED1[10];
    __IO uint32_t L4PEN;
    uint32_t RESERVED2[1];
    __IO uint32_t L4SPM;
    __IO uint32_t L4SPIM;
    __IO uint32_t L4DPM;
    __IO uint32_t L4DPIM;
    uint32_t RESERVED3[10];
} stc_eth_mac_l34ctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[18];
    __IO uint32_t VLANS;
    uint32_t RESERVED1[13];
} stc_eth_mac_vtactlr_bit_t;

typedef struct {
    __IO uint32_t TSPEN;
    __IO uint32_t TSPUPSEL;
    __IO uint32_t TSPINI;
    __IO uint32_t TSPUP;
    __IO uint32_t TSPINT;
    __IO uint32_t TSPADUP;
    uint32_t RESERVED0[2];
    __IO uint32_t TSPEALL;
    __IO uint32_t TSPSSR;
    __IO uint32_t TSPVER;
    __IO uint32_t TSPOVETH;
    __IO uint32_t TSPOVIPV6;
    __IO uint32_t TSPOVIPV4;
    uint32_t RESERVED1[4];
    __IO uint32_t TSPADF;
    uint32_t RESERVED2[13];
} stc_eth_ptp_tspctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t TSPUPNS;
} stc_eth_ptp_tmunser_bit_t;

typedef struct {
    __I  uint32_t TSOVF;
    __I  uint32_t TSTAR0;
    uint32_t RESERVED0[1];
    __I  uint32_t TSERR0;
    __I  uint32_t TSTAR1;
    __I  uint32_t TSERR1;
    uint32_t RESERVED1[26];
} stc_eth_ptp_tspstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t PPSOMD;
    uint32_t RESERVED1[27];
} stc_eth_ptp_ppsctlr_bit_t;

typedef struct {
    __IO uint32_t SWR;
    __IO uint32_t DMAA;
    uint32_t RESERVED0[5];
    __IO uint32_t DSEN;
    uint32_t RESERVED1[8];
    __IO uint32_t FBST;
    uint32_t RESERVED2[6];
    __IO uint32_t SPBL;
    __IO uint32_t M8PBL;
    __IO uint32_t AAL;
    __IO uint32_t MBST;
    __IO uint32_t TXPR;
    uint32_t RESERVED3[4];
} stc_eth_dma_busmodr_bit_t;

typedef struct {
    __IO uint32_t TIS;
    __IO uint32_t TSS;
    __IO uint32_t TUS;
    __IO uint32_t TJS;
    __IO uint32_t OVS;
    __IO uint32_t UNS;
    __IO uint32_t RIS;
    __IO uint32_t RUS;
    __IO uint32_t RSS;
    __IO uint32_t RWS;
    __IO uint32_t ETS;
    uint32_t RESERVED0[2];
    __IO uint32_t FBS;
    __IO uint32_t ERS;
    __IO uint32_t AIS;
    __IO uint32_t NIS;
    uint32_t RESERVED1[10];
    __I  uint32_t MMCS;
    __I  uint32_t PMTS;
    __I  uint32_t PTPS;
    uint32_t RESERVED2[2];
} stc_eth_dma_dmastsr_bit_t;

